Repository: weirp/fpoc
Catalog: i18n/fpoc_Maori.po
Languages: mi

source: Main page
mi: Whārangi matua

source: Local
mi: Paetata

source: Pay Someone page
mi: Tuku tetahi whārangi

source: Passwords must match
mi: Me tika nga kupuhipa

source: Please supply your name.`
mi: Tukuna koa to ingoa "

source: Name
mi: Ingoa

source: Must be a valid email address.`
mi: Me waiho he wāhitau īmēra tika. "

source: Email Address
mi: Wāhitau Īmēra

source: Password must be at least 7 characters long
mi: Me roa rawa te roa o te kupuhipa

source: Password
mi: Kupuhipa

source: Verify Password
mi: Manatoko Kupuhipa

source: A server error happened. Please try again.
mi: I puta he hapa tūmau. Tena ngana ano.

source: Sign Up!
mi: Waitohu Up!

source: Welcome! Your account has been created.
mi: Nau mai! I hangahia to korero.

source: Please, log in.
mi: Tena, takiuru.

source: Account Number
mi: Tau nama

source: Account to Account Transfer
mi: Pūkete ki te Whakawhiti Pūkete

source: Balance
mi: Tuhinga

source: Send Money Abroad
mi: Tukuna Moni Hape

source: Profile page
mi: Whārangi tohu

source: Account Limits page
mi: Tautuhinga Tautuhinga Moni

source: Preferences page
mi: Nga whārangi manakohanga

source: Email
mi: Īmēra

source: Unable to contact server. Try again later.
mi: Kāore e taea te whakapā atu ki te tūmau. Ngana ano i muri.

source: Bad username or password.
mi: Ingoa ingoa kino, kupuhipa ranei.

source: Don't have a login yet?
mi: Karekau he takiuru ano?

source: Sign up!
mi: Waitohu!

source: Log out
mi: Puta atu

source: Sign in
mi: Waitohu

source: Account
mi: Pūkete

source: Pay Someone
mi: Utu tetahi

source: Account Limits
mi: Tautuhinga Pūkete

source: Welcome!
mi: Nau mai!

source: Glad you could join us!
mi: Kia pai koe ki te uru atu ki a matou!

source: Thanks!
mi: Mauruuru!
